Repository: sponka9/Typora-i18n
Catalog: *.lproj/Front.strings
Languages: ga_ie

source: OK
ga_ie: Ceart go leor

source: Cancel
ga_ie: Cealaigh

source: Yes
ga_ie: Tá

source: No
ga_ie: Níl

source: Close
ga_ie: Dún

source: Select
ga_ie: Roghnaigh

source: Continue
ga_ie: Lean ar aghaidh

source: Learn More…
ga_ie: Foghlaim Tuilleadh…

source: Untitled
ga_ie: Gan Teideal

source: Undo
ga_ie: Cuir ar ceal

source: Dismiss
ga_ie: Díbhe

source: Confirm
ga_ie: Deimhnigh

source: Error
ga_ie: Earráid

source: Search
ga_ie: Cuardaigh

source: Replace
ga_ie: Athsholáthair

source: All
ga_ie: Gach

source: Search text not found in article
ga_ie: Níor aimsíodh téacs cuardaigh san alt

source: search text
ga_ie: téacs cuardaigh

source: Search by file name
ga_ie: Cuardaigh de réir ainm comhaid

source: Searching
ga_ie: Ag cuardach

source: Gathering more results
ga_ie: Tuilleadh torthaí a bhailiú

source: Insert Table
ga_ie: Cuir Tábla isteach

source: Columns
ga_ie: Colúin

source: Rows
ga_ie: Rónna

source: Align Left
ga_ie: Ailínigh ar Chlé

source: Align Center
ga_ie: Ailínigh Lár

source: Align Right
ga_ie: Ailínigh ar Dheis

source: Resize Table
ga_ie: Athraigh Méid an Tábla

source: Delete Table
ga_ie: Scrios Tábla

source: Typora are trying copy the newly inserted image to folder <code id='image-create-folder-target'></code> according to your YAML Front Matter setting or global preferences. But the target folder does not exist, create it now?
ga_ie: Tá Typora ag iarraidh an íomhá nua-churtha isteach a chóipeáil chuig an bhfillteán <code id='image-create-folder-target'></code> de réir do shocruithe YAML Front Matter nó do chuid sainroghanna domhanda. Ach níl an fillteán sprice ann, cruthaigh é anois?

source: Create Folder
ga_ie: Cruthaigh Fillteán

source: Edit
ga_ie: Cuir in Eagar

source: Delete Math
ga_ie: Scrios Matamaitic

source: Preview
ga_ie: Réamhamharc

source: Articles
ga_ie: Airteagail

source: Outline
ga_ie: Imlíne

source: Files
ga_ie: Comhaid

source: Switch to File List view
ga_ie: Athraigh go dtí an radharc Liosta Comhad

source: Switch to File Tree view
ga_ie: Athraigh go dtí an radharc Crann Comhad

source: Switch to Outline view
ga_ie: Athraigh go dtí an radharc Imlíne

source: Close sidebar
ga_ie: Dún an barra taoibh

source: Loading
ga_ie: Ag luchtú

source: Selected folders contains too many files. Please switch to <a id='switch-to-tree-on-oversize'>File Tree view</a> for better performance.
ga_ie: Tá an iomarca comhad sna fillteáin roghnaithe. Athraigh go <a id='switch-to-tree-on-oversize'>radharc crann comhaid</a> le haghaidh feidhmíocht níos fearr.

source: New File
ga_ie: Comhad Nua

source: Unpin Outline Panel
ga_ie: Díphionáil an Painéal Imlíne

source: Open Folder...
ga_ie: Oscail Fillteán...

source: Action
ga_ie: Gníomh

source: Close Sidebar Menu
ga_ie: Dún an Roghchlár Barra Taoibh

source: Reveal in Finder
ga_ie: Nochtadh san Aimsitheoir

source: Reveal in File Explorer
ga_ie: Nochtadh i dTaiscéalaí Comhad

source: Refresh Folder
ga_ie: Athnuachan Fillteán

source: Sort
ga_ie: Sórtáil

source: Group By Folder
ga_ie: Grúpáil de réir Fillteáin

source: Sort Naturally (Ascending)
ga_ie: Sórtáil go Nádúrtha (Ardú)

source: Sort Naturally (Descending)
ga_ie: Sórtáil go Nádúrtha (Íslitheach)

source: Sort by Name (Ascending)
ga_ie: Sórtáil de réir Ainm (Ardú)

source: Sort by Modification Date (Ascending)
ga_ie: Sórtáil de réir Dáta an Mhodhnaithe (Ardú)

source: Sort by Name (Descending)
ga_ie: Sórtáil de réir Ainm (Íslitheach)

source: Sort by Modification Date (Descending)
ga_ie: Sórtáil de réir Dáta an Athraithe (Íslitheach)

source: Location
ga_ie: Suíomh

source: Switch File List/Tree View
ga_ie: Athraigh Liosta Comhad/Radharc Crann

source: No Files Available
ga_ie: Gan Comhaid Ar Fáil

source: No Folder is Opened.
ga_ie: Níl aon fhillteán oscailte.

source: Outline is Empty.
ga_ie: Tá an imlíne folamh.

source: Toggle Sidebar
ga_ie: Barra Taobh a Athraigh

source: Toggle Source Code Mode
ga_ie: Mód an Chóid Foinse a Athrú

source: Exit Source Code Mode
ga_ie: Scoir Mód an Chóid Foinse

source: Table of Contents
ga_ie: Clár Ábhair

source: Empty Diagram
ga_ie: Léaráid Folamh

source: Input Math TeX here
ga_ie: Iontráil Math TeX anseo

source: Need to define the reference footnote <b>{0}</b> with syntax <a>[^{1}]: www.example.com</a>
ga_ie: Ní mór an fonóta tagartha <b>{0}</b> a shainiú le comhréir <a>[^{1}]: www.example.com</a>

source: Need to define the reference link <b>[{0}]</b> with syntax <b>[{1}]: www.example.com</b>
ga_ie: Ní mór an nasc tagartha <b>[{0}]</b> a shainiú le comhréir <b>[{1}]: www.example.com</b>

source: Please define image reference by [{0}]: http://example.png
ga_ie: Sainmhínigh tagairt íomhá le do thoil le [{0}]: http://example.png

source: Failed to create file
ga_ie: Theip ar chomhad a chruthú

source: Failed to create folder
ga_ie: Theip ar fhillteán a chruthú

source: Failed to rename file
ga_ie: Theip ar an gcomhad a athainmniú

source: Folder does not exist at %@
ga_ie: Níl an fillteán ann ag %@

source: File with the same name already exists at target path
ga_ie: Tá comhad leis an ainm céanna ann cheana féin ag an gcosán sprice

source: Apply to All
ga_ie: Cuir i bhFeidhm ar Gach Duine

source: Overwrite
ga_ie: Forscríobh

source: Stop
ga_ie: Stad

source: back to document
ga_ie: ar ais chuig an doiciméad

source: Failed to load file
ga_ie: Theip ar an gcomhad a luchtú

source: Save File Failed!
ga_ie: Theip ar an gComhad a Shábháil!

source: Cannot open folder {0}
ga_ie: Ní féidir fillteán {0} a oscailt

source: File content is changed by external applications. Reload content from disk ?
ga_ie: Athraíonn feidhmchláir sheachtracha ábhar an chomhaid. Athlódáil an t-ábhar ón diosca?

source: Should continue moving and overwrite existing file(s) ?
ga_ie: Ar cheart leanúint ar aghaidh ag bogadh agus ag athscríobh an chomhaid/na gcomhad(anna) atá ann cheana?

source: Rename to "{0}" ?
ga_ie: Athainmnigh go "{0}" ?

source: Failed to rename from "{0}" to "{1}"
ga_ie: Theip ar athainmniú ó "{0}" go "{1}"

source: Successfully uploaded {0} images.
ga_ie: Uaslódáileadh {0} íomhá go rathúil.

source: Failed to upload image. Error Message:
ga_ie: Theip ar an íomhá a uaslódáil. Teachtaireacht Earráide:

source: Failed to Copy Image to Target Folder.
ga_ie: Theip ar an íomhá a chóipeáil chuig an bhfillteán sprice.

source: Select Container Folder
ga_ie: Roghnaigh Fillteán Coimeádáin

source: Saved
ga_ie: Sábháilte

source: replace with
ga_ie: cuir ina áit le

source: Case Sensitive
ga_ie: Cás-íogair

source: Whole Word
ga_ie: Focal Iomlán

source: input image URL
ga_ie: URL íomhá ionchuir

source: Select image from local file
ga_ie: Roghnaigh íomhá ó chomhad áitiúil

source: Cannot open location <code>$1</code>, do you mean <a href='$3' target='_blank' target='_blank'>$2</a> ?
ga_ie: Ní féidir suíomh <code>$1</code> a oscailt, an bhfuil tú ag tagairt do <a href='$3' target='_blank' target='_blank'>$2</a>?

source: Finish Editing
ga_ie: Críochnaigh an Eagarthóireacht

source: Revert advanced setting file to default one ?
ga_ie: An comhad socruithe ardleibhéil a chur ar ais go dtí an ceann réamhshocraithe?

source: Select Spell Check Language
ga_ie: Roghnaigh Teanga an tSeiceálaí Litrithe

source: Auto Detect Language
ga_ie: Teanga a Bhraith go hUathoibríoch

source: Disable Spell Check
ga_ie: Díchumasaigh Seiceáil Litrithe

source: Global Setting…
ga_ie: Socrú Domhanda…

source: Dictionary file is missing to enable spellcheck support for %@.
ga_ie: Tá comhad foclóra ar iarraidh chun tacaíocht litrithe a chumasú do %@.

source: Install Language Support
ga_ie: Suiteáil Tacaíocht Teanga

source: License Information
ga_ie: Faisnéis Ceadúnais

source: Download
ga_ie: Íoslódáil

source: Install dictionary file only for Typora
ga_ie: Suiteáil comhad foclóra le haghaidh Typora amháin

source: Spell Check (%@ unavailable)
ga_ie: Seiceáil Litrithe (%@ ar fáil)

source: Spell Check (%@ downloading)
ga_ie: Seiceáil Litrithe (%@ ag íoslódáil)

source: Download dictionary file for %@
ga_ie: Íoslódáil comhad foclóra le haghaidh %@

source: (Default spell check option)
ga_ie: (Rogha réamhshocraithe seiceála litrithe)

source: Failed to load spellcheck module
ga_ie: Theip ar an modúl litrithe a luchtú

source: <strong>%@</strong> has been turned on.
ga_ie: Tá <strong>%@</strong> casta air.

source: You could turn it off from `View` menu.
ga_ie: D’fhéadfá é a mhúchadh ón roghchlár ‘Amharc’.

source: The file is too large to render in Typora.
ga_ie: Tá an comhad rómhór le rindreáil in Typora.

source: Open in…
ga_ie: Oscail i…

source: Quick Look
ga_ie: Amharc Tapa

source: Filter
ga_ie: Scagaire

source: No result found.
ga_ie: Níor aimsíodh aon toradh.

source: Continue & Overwrite
ga_ie: Lean ar aghaidh & Forscríobh

source: The file is read-only, or you do not have right permissions to modify the file.
ga_ie: Tá an comhad inléite amháin, nó níl na ceadanna cearta agat chun an comhad a mhodhnú.

source: Learn Data Recovery
ga_ie: Foghlaim Aisghabháil Sonraí

source: Auto refresh on Files Panel cannot be enabled.
ga_ie: Ní féidir athnuachan uathoibríoch ar an bPainéal Comhad a chumasú.

source: Delete Permanently
ga_ie: Scrios go Buan

source: Failed to upload images:
ga_ie: Theip ar íomhánna a uaslódáil:

source: Uploading in progress
ga_ie: Ag uaslódáil ar siúl

source: Successfully uploaded {0} images, {1} failed.
ga_ie: Uaslódáileadh {0} íomhá go rathúil, theip ar {1}.

source: You could undo this operation later via `Edit` → `Undo`.
ga_ie: D’fhéadfá an oibríocht seo a chealú níos déanaí trí `Eagar` → `Cuir ar ceal`.

source: You can press <strong>⌘ + Click</strong> to open <a href='#'>links</a> or jump to footnote definition.
ga_ie: Is féidir leat brú a chur ar <strong>⌘ + Cliceáil</strong> chun <a href='#'>naisc</a> a oscailt nó léim go dtí sainmhíniú an nóta.

source: You can press <strong>CTRL + Click</strong> to open <a href='#'>links</a> or jump to footnote definition.
ga_ie: Is féidir leat brú a chur ar <strong>CTRL + Cliceáil</strong> chun <a href='#'>naisc</a> a oscailt nó léim go dtí sainmhíniú an nóta.

source: <strong>Unibody</strong> style has been turned on.
ga_ie: Tá stíl <strong>Unibody</strong> casta air.

source: You can right click titlebar to popup application menu.
ga_ie: Is féidir leat cliceáil ar dheis ar an mbarra teidil chun roghchlár an fheidhmchláir a fheiceáil.

source: Support Document
ga_ie: Doiciméad Tacaíochta

source: You are not supposed to edit or save this file.
ga_ie: Ní cheart duit an comhad seo a chur in eagar ná a shábháil.

source: Files in this location (%@) are managed by Typora, and may be deleted automatically.<br/>Please copy content to a new file for further editing.
ga_ie: Déanann Typora bainistíocht ar na comhaid sa suíomh seo (%@), agus féadfar iad a scriosadh go huathoibríoch.<br/>Cóipeáil an t-ábhar chuig comhad nua le haghaidh eagarthóireachta breise.

source: File does not exist at path %@.
ga_ie: Níl an comhad ann ag an gcosán %@.

source: File does not exist at path %@, do you want to create one at that path?
ga_ie: Níl an comhad ann ag an gcosán %@, ar mhaith leat ceann a chruthú ag an gcosán sin?

source: No Results
ga_ie: Gan Torthaí

source: Too many matches
ga_ie: An iomarca cluichí

source: Regular Expression
ga_ie: Léiriú Rialta

source: Sort by Creation Date (Ascending)
ga_ie: Sórtáil de réir Dáta Cruthaithe (Ardú)

source: Sort by Creation Date (Descending)
ga_ie: Sórtáil de réir Dáta Cruthaithe (Íslitheach)

source: code language
ga_ie: teanga chód

source: Cannot rename from $1 to $2, please use "File" → "Move To…" from menubar instead.
ga_ie: Ní féidir an t-ainm a athrú ó $1 go $2, bain úsáid as "Comhad" → "Bog Chuig…" ón mbarra roghchláir ina ionad.

source: Markdown file
ga_ie: Comhad Markdown

source: TextBundle file
ga_ie: Comhad TextBundle

source: Images saved to TextBundle
ga_ie: Íomhánna sábháilte chuig TextBundle
