Repository: sponka9/Typora-i18n
Catalog: *.lproj/Menu.strings
Languages: ga_ie

source: About Typora
ga_ie: Maidir le Typora

source: Preferences
ga_ie: Roghanna

source: Check for Updates
ga_ie: Seiceáil le haghaidh Nuashonruithe

source: Services
ga_ie: Seirbhísí

source: Hide Typora
ga_ie: Folaigh Typora

source: Hide Others
ga_ie: Folaigh Eile

source: Show All
ga_ie: Taispeáin Gach Rud

source: Quit Typora
ga_ie: Scoir de Typora

source: File
ga_ie: Comhad

source: New
ga_ie: Nua

source: Open
ga_ie: Oscail

source: Open Folder
ga_ie: Oscail Fillteán

source: Reopen with Encoding
ga_ie: Athoscail le hIonchódú

source: Auto
ga_ie: Uathoibríoch

source: Open Recent
ga_ie: Oscail Le Déanaí

source: Recent Locations
ga_ie: Suíomhanna Le Déanaí

source: Clear Items
ga_ie: Glan Míreanna

source: No Recent Files
ga_ie: Gan Comhaid Le Déanaí

source: Open Quickly
ga_ie: Oscail go Tapaidh

source: Open File Location
ga_ie: Oscail Suíomh an Chomhaid

source: Reveal in Library
ga_ie: Nochtadh sa Leabharlann

source: Reveal in File Tree
ga_ie: Nochtadh sa Chrann Comhad

source: Close
ga_ie: Dún

source: Save
ga_ie: Sábháil

source: Save As
ga_ie: Sábháil Mar

source: Duplicate
ga_ie: Dúblach

source: Rename
ga_ie: Athainmnigh

source: Move To
ga_ie: Bog Go

source: Revert To
ga_ie: Fill ar

source: Browse All Versions
ga_ie: Brabhsáil Gach Leagan

source: Import
ga_ie: Iompórtáil

source: Export
ga_ie: Easpórtáil

source: Page Setup
ga_ie: Socrú Leathanaigh

source: Print
ga_ie: Priontáil

source: Edit
ga_ie: Cuir in Eagar

source: Undo
ga_ie: Cuir ar ceal

source: Redo
ga_ie: Déan arís

source: Cut
ga_ie: Gearr

source: Copy
ga_ie: Cóipeáil

source: Paste
ga_ie: Greamaigh

source: Copy as Markdown
ga_ie: Cóipeáil mar Markdown

source: Copy as HTML Code
ga_ie: Cóipeáil mar Chód HTML

source: Paste as Plain Text
ga_ie: Greamaigh mar Théacs Gnáth

source: Select All
ga_ie: Roghnaigh Uile

source: Select Line / Sentence
ga_ie: Roghnaigh Líne / Abairt

source: Select Styled Scope
ga_ie: Roghnaigh Raon Feidhme Stíleáilte

source: Select Word
ga_ie: Roghnaigh Focal

source: Delete
ga_ie: Scrios

source: Delete Range
ga_ie: Scrios Raon

source: Delete Word
ga_ie: Scrios Focal

source: Delete Styled Scope
ga_ie: Scrios Raon Feidhme Stíleáilte

source: Jump To
ga_ie: Léim go

source: Jump to Top
ga_ie: Léim go Barr

source: Jump to Selection
ga_ie: Léim go dtí an Roghnú

source: Jump to Bottom
ga_ie: Léim go Bun

source: Math Tools
ga_ie: Uirlisí Matamaitice

source: Refresh All Math Expressions
ga_ie: Athnuaigh Gach Sloinnt Matamaitice

source: Image Tools
ga_ie: Uirlisí Íomhá

source: Insert Local Images
ga_ie: Ionsáigh Íomhánna áitiúla

source: Upload Local Images via iPic
ga_ie: Uaslódáil Íomhánna Áitiúla trí iPic

source: When Insert Local Image
ga_ie: Nuair a chuirtear Íomhá Áitiúil Isteach

source: Copy Image File to Folder
ga_ie: Cóipeáil Comhad Íomhá chuig Fillteán

source: Use Image Root Path
ga_ie: Úsáid Cosán Fréamh Íomhá

source: Line Endings
ga_ie: Deireadh Líne

source: Windows Line Endings (CRLF)
ga_ie: Deireadh Líne Windows (CRLF)

source: Unix Line Endings (LF)
ga_ie: Deireadh Líne Unix (LF)

source: Find
ga_ie: Aimsigh

source: Find Next
ga_ie: Aimsigh Ar Aghaidh

source: Find Previous
ga_ie: Aimsigh Roimhe Seo

source: Find and Replace
ga_ie: Aimsigh agus Ionadaigh

source: Replace
ga_ie: Ionadaigh

source: Replace Next
ga_ie: Ionadaigh Ar Aghaidh

source: Spelling and Grammar
ga_ie: Litriú agus Gramadach

source: Check Document Now
ga_ie: Seiceáil an Doiciméad Anois

source: Check Spelling While Typing
ga_ie: Seiceáil Litriú agus Clóscríobh

source: Check Grammar With Spelling
ga_ie: Seiceáil Gramadach le Litriú

source: Correct Spelling Automatically
ga_ie: Ceartú Litrithe go hUathoibríoch

source: Substitutions
ga_ie: Ionadaithe

source: Smart Quotes
ga_ie: Sleachta Cliste

source: Smart Dashes
ga_ie: Dashes Cliste

source: Text Replacement
ga_ie: Athsholáthar Téacs

source: Speech
ga_ie: Óráid

source: Start Speaking
ga_ie: Tosaigh Urlabhra

source: Stop Speaking
ga_ie: Stop Urlabhra

source: Paragraph
ga_ie: Paragraf

source: Heading 1
ga_ie: Ceannteideal 1

source: Heading 2
ga_ie: Ceannteideal 2

source: Heading 3
ga_ie: Ceannteideal 3

source: Heading 4
ga_ie: Ceannteideal 4

source: Heading 5
ga_ie: Ceannteideal 5

source: Heading 6
ga_ie: Ceannteideal 6

source: Increase Heading Level
ga_ie: Méadaigh Leibhéal an Cheannteidil

source: Decrease Heading Level
ga_ie: Laghdaigh Leibhéal Ceannteidil

source: Table
ga_ie: Tábla

source: Code Fences
ga_ie: Fálta Cód

source: Math Block
ga_ie: Bloc Matamaitice

source: Quote
ga_ie: Luachan

source: Ordered List
ga_ie: Liosta Ordaithe

source: Unordered List
ga_ie: Liosta Gan Ordú

source: Task List
ga_ie: Liosta Tascanna

source: Task Status
ga_ie: Stádas na Tascanna

source: Toggle Task Status
ga_ie: Stádas na Tascanna a Athrú

source: Mark as Complete
ga_ie: Marcáil mar Chríochnaithe

source: Mark as Incomplete
ga_ie: Marcáil mar Neamhchríochnaithe

source: List Indentation
ga_ie: Intéadú Liosta

source: Indent
ga_ie: Eangaigh

source: Outdent
ga_ie: Dí-eangaigh

source: Link Reference
ga_ie: Tagairt Nasc

source: Footnotes
ga_ie: Nótaí Cos

source: Horizontal Line
ga_ie: Líne Chothrománach

source: Table of Contents
ga_ie: Clár na nÁbhar

source: YAML Front Matter
ga_ie: Ábhar Tosaigh YAML

source: Format
ga_ie: Formáid

source: Strong
ga_ie: Láidir

source: Emphasis
ga_ie: Béim

source: Underline
ga_ie: Folínigh

source: Code
ga_ie: Cód

source: Inline Math
ga_ie: Matamaitic Inlíne

source: Strike
ga_ie: Stailc

source: Highlight
ga_ie: Aibhsigh

source: Superscript
ga_ie: Forscríbhinn

source: Subscript
ga_ie: Fo-scríbhinn

source: Comment
ga_ie: Trácht

source: Hyperlink
ga_ie: Hipirnasc

source: Image
ga_ie: Íomhá

source: Clear Format
ga_ie: Formáid Glan

source: View
ga_ie: Amharc

source: New Tab
ga_ie: Cluaisín Nua

source: Source Code Mode
ga_ie: Mód Cód Foinse

source: Focus Mode
ga_ie: Mód Fócais

source: Typewriter Mode
ga_ie: Mód Clóscríbhneora

source: Toggle Sidebar
ga_ie: Scoránaigh Barra Taoibh

source: Outline
ga_ie: Imlíne

source: Articles
ga_ie: Airteagail

source: File Tree
ga_ie: Crann Comhad

source: Always on Top
ga_ie: I gcónaí ar a Bharr

source: Full Screen
ga_ie: Lánscáileán

source: Show Status Bar
ga_ie: Taispeáin Barra Stádais

source: Toggle Fullscreen
ga_ie: Lánscáileán a Athsholáthar

source: Actual Size
ga_ie: Méid iarbhír

source: Zoom In
ga_ie: Zúmáil Isteach

source: Zoom Out
ga_ie: Zúmáil Amach

source: Switch Between Opened Documents
ga_ie: Athraigh Idir Doiciméid Oscailte

source: Toggle DevTools
ga_ie: Uirlisí Forbróra a Athrú

source: Themes
ga_ie: Téamaí

source: Window
ga_ie: Fuinneog

source: Minimize
ga_ie: Íoslaghdaigh

source: Zoom
ga_ie: Zúmáil

source: Bring All to Front
ga_ie: Tabhair Gach Rud chun Tosaigh

source: Help
ga_ie: Cabhair

source: Privacy Policy
ga_ie: Polasaí Príobháideachais

source: Credits
ga_ie: Creidmheasanna

source: Change Log
ga_ie: Log Athraithe

source: Website
ga_ie: Suíomh Gréasáin

source: Feedback
ga_ie: Aiseolas

source: About
ga_ie: Maidir

source: Block Styles
ga_ie: Stíleanna Bloc

source: Inline Styles
ga_ie: Stíleanna Inlíne

source: List Styles / Remove Block
ga_ie: Stíleanna Liosta / Bain Bloc

source: Exit Source Code Mode
ga_ie: Scoir Mód an Chóid Foinse

source: Toggle Source Code Mode
ga_ie: Mód an Chóid Foinse a Athrú

source: Add Row Above
ga_ie: Cuir Ró Thuas

source: Add Row Below
ga_ie: Cuir Ró Faoi

source: Delete Row
ga_ie: Scrios an Ró

source: Add Column Before
ga_ie: Cuir Colún Roimhe

source: Add Column After
ga_ie: Cuir Colún leis ina dhiaidh

source: Delete Column
ga_ie: Scrios Colún

source: Copy Table
ga_ie: Cóipeáil Tábla

source: Delete Table
ga_ie: Scrios Tábla

source: Insert Paragraph After
ga_ie: Ionsáigh Paragraf ina dhiaidh

source: Insert Paragraph Before
ga_ie: Ionsáigh Paragraf Roimhe

source: Delete Code Block
ga_ie: Scrios Bloc Cód

source: Copy as MathML
ga_ie: Cóipeáil mar MathML

source: Copy as Tex
ga_ie: Cóipeáil mar Tex

source: Copy Math
ga_ie: Cóipeáil Matamaitice

source: Reveal in Finder
ga_ie: Nochtadh san Aimsitheoir

source: Open Link
ga_ie: Oscail an Nasc

source: Reveal in Sidebar
ga_ie: Nochtadh sa Bharra Taobh

source: Open in New Window
ga_ie: Oscail i bhFuinneog Nua

source: Copy File Path
ga_ie: Cóipeáil Cosán Comhaid

source: New File
ga_ie: Comhad Nua

source: New Folder
ga_ie: Fillteán Nua

source: Learn Spelling
ga_ie: Foghlaim Litriú

source: Copy / Paste As
ga_ie: Cóipeáil / Greamaigh Mar

source: Math
ga_ie: Matamaitic

source: Insert
ga_ie: Ionsáigh

source: Inspect Element
ga_ie: Iniúchadh a dhéanamh ar an Eilimint

source: Copy to MS Word
ga_ie: Cóipeáil chuig MS Word

source: Paragraph (before)
ga_ie: Paragraf (roimh)

source: Paragraph (after)
ga_ie: Paragraf (i ndiaidh)

source: Search with Google
ga_ie: Cuardaigh le Google

source: Search With…
ga_ie: Cuardaigh Le…

source: Open Failed
ga_ie: Theip ar Oscailt

source: File or folder does not exist.
ga_ie: Níl an comhad ná an fillteán ann.

source: Prettify Source Code
ga_ie: Áilleacht an Chóid Foinse

source: Copy '%@'
ga_ie: Cóipeáil '%@'

source: Copy to %@
ga_ie: Cóipeáil go %@

source: Copy Image to
ga_ie: Cóipeáil Íomhá chuig

source: Open Image Location
ga_ie: Oscail Suíomh na hÍomhá

source: Learn More
ga_ie: Foghlaim Tuilleadh

source: Whitespace and Line Breaks
ga_ie: Spás Bán agus Briseadh Líne

source: Indent first line of paragraphs
ga_ie: Cuir isteach an chéad líne de pharagraif

source: Preserve single line break
ga_ie: Coimeád briseadh líne aonair

source: Visible <br/>
ga_ie: Infheicthe <br/>

source: Save All
ga_ie: Sábháil Uile

source: New Window
ga_ie: Fuinneog Nua

source: Reopen Closed File
ga_ie: Athoscail an Comhad Dúnta

source: Global Image Settings
ga_ie: Socruithe Íomhá Domhanda

source: Smart Punctuation
ga_ie: Poncaíocht Chliste

source: Convert on Input
ga_ie: Tiontaigh ar Ionchur

source: Convert on Rendering
ga_ie: Tiontaigh ar Rindreáil

source: Remap Unicode Punctuation on Parse
ga_ie: Athmhapáil Poncaíocht Unicode ar Pharsáil

source: More Options
ga_ie: Tuilleadh Roghanna

source: HTML Block
ga_ie: Bloc HTML

source: Delete Paragraph / Block
ga_ie: Scrios Paragraf / Bloc

source: Delete %@
ga_ie: Scrios %@

source: Play
ga_ie: Seinn

source: Pause
ga_ie: Sos

source: Spell Check
ga_ie: Seiceáil Litrithe

source: Unlearn Spelling
ga_ie: Dífhoghlaim Litriú

source: Properties
ga_ie: Airíonna

source: Search
ga_ie: Cuardaigh

source: Copy without Theme Styling
ga_ie: Cóipeáil gan Stíl Téama

source: Recent Files
ga_ie: Comhaid Le Déanaí

source: File Results
ga_ie: Torthaí Comhaid

source: Insert Table
ga_ie: Cuir Tábla isteach

source: Insert Image
ga_ie: Cuir Íomhá isteach

source: Allow Magnification
ga_ie: Ceadaigh Formhéadú

source: Move Row Up
ga_ie: Bog Ró Suas

source: Move Row Down
ga_ie: Bog Ró Síos

source: Move Column Left
ga_ie: Bog an Colún ar Chlé

source: Move Column Right
ga_ie: Bog an Colún ar Dheis

source: Zoom Image
ga_ie: Íomhá Zúmáil

source: Zoom Image to %@
ga_ie: Zúmáil Íomhá go %@

source: Copy as Plain Text
ga_ie: Cóipeáil mar Gnáththéacs

source: Selection
ga_ie: Roghnú

source: Check Updates
ga_ie: Seiceáil Nuashonruithe

source: HTML (without Styles)
ga_ie: HTML (gan Stíleanna)

source: Highlight Current Header
ga_ie: Aibhsigh an Ceanntásc Reatha

source: Expand All
ga_ie: Leathnaigh Uile

source: Collapse All
ga_ie: Laghdaigh Gach Rud

source: Collapsible Outline
ga_ie: Imlíne Infhillte

source: Flat Outline
ga_ie: Imlíne Chomhréidh

source: Articles (List View)
ga_ie: Ailt (Radharc Liosta)

source: File Tree (Tree View)
ga_ie: Crann Comhad (Radharc Crann)

source: Filter
ga_ie: Scagaire

source: Upload Image
ga_ie: Uaslódáil Íomhá

source: Upload All Local Images
ga_ie: Uaslódáil Gach Íomhá Áitiúil

source: Open Image in Browser
ga_ie: Oscail Íomhá sa Bhrabhsálaí

source: Copy Image Content
ga_ie: Cóipeáil Ábhar Íomhá

source: More Actions
ga_ie: Tuilleadh Gníomhartha

source: Get Info
ga_ie: Faigh Eolas

source: Export with Previous
ga_ie: Easpórtáil leis an Roimhe Seo

source: Export and Overwrite with Previous
ga_ie: Easpórtáil agus Forscríobh leis an Roimhe Seo

source: Emoji and Symbols
ga_ie: Emoji agus Siombailí

source: Insert Final New Line On Save
ga_ie: Cuir Líne Nua Deiridh isteach ar Shábháil

source: Hyperlink Actions
ga_ie: Gníomhartha Hipirnaisc

source: Copy Link Address
ga_ie: Cóipeáil Seoladh an Naisc

source: Click
ga_ie: Cliceáil

source: Export Setting
ga_ie: Socrú Easpórtála

source: My License
ga_ie: Mo Cheadúnas

source: Registration / Activation
ga_ie: Clárú / Gníomhachtú

source: Select Paragraph / Block
ga_ie: Roghnaigh Paragraf / Bloc

source: Delete Selected
ga_ie: Scrios Roghnaithe

source: Rename or Move Image to
ga_ie: Athainmnigh nó Bog Íomhá go

source: Move to %@
ga_ie: Bog go %@

source: Delete Image
ga_ie: Scrios Íomhá

source: Delete Image File
ga_ie: Scrios Comhad Íomhá

source: Reload All Images
ga_ie: Athlódáil na hÍomháigh Uile

source: Save %@ As
ga_ie: Sábháil %@ Mar

source: Copy All Images to
ga_ie: Cóipeáil Gach Íomhá chuig

source: Move All Images to
ga_ie: Bog Gach Íomhá go

source: Copy as Image
ga_ie: Cóipeáil mar Íomhá

source: Switch Image Syntax
ga_ie: Athraigh Comhréir Íomhá

source: Markdown Style
ga_ie: Stíl Markdown

source: HTML Style
ga_ie: Stíl HTML

source: Code Tools
ga_ie: Uirlisí Cóid

source: Copy Code Content
ga_ie: Cóipeáil Ábhar an Chóid

source: Auto Indent Selected Code
ga_ie: Uath-Indentáil Cód Roghnaithe

source: Auto Indent Whole Code
ga_ie: Uath-Indentáil an Chóid Iomlán

source: Jump to Line Start
ga_ie: Léim go dtí Tús na Líne

source: Jump to Line End
ga_ie: Léim go dtí Deireadh na Líne

source: Toggle Word Count Popover
ga_ie: Scoránaigh Comhaireamh Focal

source: Toggle Outline Popover
ga_ie: Scoránaigh Imlíne Popover

source: Alert
ga_ie: Airdeall

source: Note Block
ga_ie: Bloc Nótaí

source: Tip Block
ga_ie: Bloc Leid

source: Important Block
ga_ie: Bloc Tábhachtach

source: Warning Block
ga_ie: Bloc Rabhaidh

source: Caution Block
ga_ie: Bloc Faichill

source: Move Table Row Up
ga_ie: Bog Ró Tábla Suas

source: Move Table Row Down
ga_ie: Bog Tábla na Ró Síos

source: Move Table Column Left
ga_ie: Bog Colún an Tábla ar Chlé

source: Move Table Column Right
ga_ie: Bog Colún Tábla ar Dheis
