Repository: sponka9/Typora-i18n
Catalog: *.lproj/Panel.strings
Languages: ga_ie

source: Preferences
ga_ie: Roghanna

source: General
ga_ie: Ginearálta

source: Window Style
ga_ie: Stíl Fuinneoige

source: Classic
ga_ie: Clasaiceach

source: Seamless
ga_ie: Gan uaim

source: Seamless window only support OS X later than 10.10.
ga_ie: Ní thacaíonn fuinneog gan uaim ach le OS X níos déanaí ná 10.10.

source: Themes
ga_ie: Téamaí

source: Open Theme Folder
ga_ie: Oscail Fillteán Téama

source: Please check `help`->`Quick Start` for short introduction. Visit http://theme.typora.io to get more themes or instructions.
ga_ie: Seiceáil `cabhair`->`Tús Tapa` le haghaidh réamhrá gairid. Tabhair cuairt ar http://theme.typora.io chun tuilleadh téamaí nó treoracha a fháil.

source: Word Count
ga_ie: Líon na bhFocal

source: Always Show Word Count
ga_ie: Taispeáin Líon na bhFocal i gCónaí

source: Font Size
ga_ie: Méid Cló

source: Auto ( Recommended )
ga_ie: Uathoibríoch (Molta)

source: Customized
ga_ie: Saincheaptha

source: If custom font size is used, the actual font size will depend on the base font size and css style.
ga_ie: Má úsáidtear méid cló saincheaptha, beidh an méid cló iarbhír ag brath ar mhéid an chló bhunúsaigh agus ar an stíl css.

source: Left Panel
ga_ie: Painéal Clé

source: Show Outline Panel by Default
ga_ie: Taispeáin an Painéal Imlíne de réir Réamhshocraithe

source: Collapsible Outline on Left Panel
ga_ie: Imlíne Infhillte ar an bPainéal Clé

source: Save without asking when switch files on side panel
ga_ie: Sábháil gan fiafraí nuair a athraítear comhaid ar an bpainéal taobh

source: Edited files will be saved without asking when switch files in left panel. When "Ask to keep changes when closing documents" is disabled in System Preference, this is always enabled.
ga_ie: Sábhálfar comhaid eagraithe gan iarraidh nuair a athraítear comhaid sa phainéal clé. Nuair a bhíonn "Iarr athruithe a choinneáil agus doiciméid á ndúnadh" díchumasaithe i Rogha an Chórais, bíonn sé seo cumasaithe i gcónaí.

source: System Language
ga_ie: Teanga an Chórais

source: Editor
ga_ie: Eagarthóir

source: Indent Size on Save
ga_ie: Méid an Eangaigh ar Shábháil

source: only apply to quotes and lists created from menu bar or hybrid view
ga_ie: ní bhaineann sé ach le luachana agus liostaí a cruthaíodh ón mbarra roghchláir nó ón radharc hibrideach

source: Trigger Autocomplete without ESC key for
ga_ie: Spreag Uathchríochnú gan eochair ESC le haghaidh

source: Emoji (e.g. :smile:)
ga_ie: Emoji (m.sh. :aoibh gháire:)

source: Images Insert
ga_ie: Íomhánna a Ionsáigh

source: Use relative path if possible
ga_ie: Bain úsáid as cosán coibhneasta más féidir

source: Auto Pair
ga_ie: Péireáil Uathoibríoch

source: Auto pair brackets and quotes
ga_ie: Péireáil uathoibríoch lúibíní agus comharthaí athfhriotail

source: Auto pair common Markdown syntax
ga_ie: Comhréir choitianta Markdown péireála uathoibríoch

source: Live Rendering
ga_ie: Rindreáil Bheo

source: Display source for simple blocks (including headings, etc.) on focus
ga_ie: Foinse taispeána do bhloic shimplí (lena n-áirítear ceannteidil, srl.) ar fhócas

source: Default Copy Behavior
ga_ie: Iompar Cóipeála Réamhshocraithe

source: Copy Markdown source as plain text
ga_ie: Cóipeáil foinse Markdown mar théacs simplí

source: Typewriter Mode
ga_ie: Mód Clóscríbhneora

source: Always keep caret in middle of screen when typewriter mode is enabled
ga_ie: Coinnigh an cairpéad i lár an scáileáin i gcónaí nuair a bhíonn mód clóscríbhneora cumasaithe

source: (Following preferences will be applied after restart.)
ga_ie: (Cuirfear na roghanna seo a leanas i bhfeidhm tar éis atosaithe.)

source: Syntax Support
ga_ie: Tacaíocht Chomhréire

source: Inline Math (e.g: $LaTeX$)
ga_ie: Matamaitic Inlíne (m.sh.: $LaTeX$)

source: Subscript (e.g: H~2~O)
ga_ie: Fo-scríbhinn (m.sh.: H~2~O)

source: Superscript (e.g: X^2^)
ga_ie: Forscríbhinn (m.sh.: X^2^)

source: Highlight (e.g: ==key==)
ga_ie: Aibhsigh (m.sh.: ==eochair==)

source: Diagrams
ga_ie: Léaráidí

source: (Sequence, Flowchart and Mermaid)
ga_ie: (Seicheamh, Cairt Shreabhadh agus Maighdean Mhara)

source: Syntax Preference
ga_ie: Rogha Comhréire

source: (only applies to styles created from menubar or hybrid view)
ga_ie: (ní bhaineann sé ach le stíleanna a cruthaíodh ón mbarra roghchláir nó ón radharc hibrideach)

source: Strict Mode
ga_ie: Mód Dian

source: (more strict to GFM spec)
ga_ie: (níos déine i gcomhréir le sonraíocht GFM)

source: Heading Style
ga_ie: Stíl Ceannteidil

source: Unordered List
ga_ie: Liosta Gan Ordú

source: Ordered List
ga_ie: Liosta Ordaithe

source: Code Fences
ga_ie: Fálta Cód

source: Display line numbers for code fences
ga_ie: Taispeáin uimhreacha líne le haghaidh fálta cóid

source: Math Blocks
ga_ie: Bloic Matamaitice

source: Auto Numbering Math Equations
ga_ie: Cothromóidí Matamaitice Uimhrithe Uathoibríoch

source: Security
ga_ie: Slándáil

source: Enable Debug
ga_ie: Cumasaigh Dífhabhtú

source: Send Anonymous Usage Info
ga_ie: Seol Eolas Úsáide Gan Ainm

source: Require Pandoc to Continue...
ga_ie: Éiligh ar Pandoc leanúint ar aghaidh...

source: Follow instructions to install Pandoc
ga_ie: Lean na treoracha chun Pandoc a shuiteáil

source: Cancel
ga_ie: Cealaigh

source: Importing...
ga_ie: Á iompórtáil...

source: Importing in progress...
ga_ie: Iompórtáil ar siúl...

source: Converting file with Pandoc. This may take some time.
ga_ie: Ag tiontú comhaid le Pandoc. D’fhéadfadh sé seo roinnt ama a thógáil.

source: Abort
ga_ie: Tobscoir

source: Exporting...
ga_ie: Ag easpórtáil...

source: Exporting in progress...
ga_ie: Easpórtáil ar siúl...

source: Pandoc is needed for importing these file formats
ga_ie: Tá Pandoc ag teastáil chun na formáidí comhaid seo a allmhairiú

source: Check help->Install and use Pandoc from menubar for detail
ga_ie: Seiceáil cabhair->Suiteáil agus úsáid Pandoc ón mbarra roghchláir le haghaidh sonraí

source: Import or some export features requires <a href='http://pandoc.org/' target='_blank'>Pandoc</a> (≥ v2.0) to be installed.
ga_ie: Éilíonn roinnt gnéithe allmhairithe nó easpórtála <a href='http://pandoc.org/' target='_blank'>Pandoc</a> (≥ v2.0) a bheith suiteáilte.

source: Follow Instructions to Install/Update Pandoc
ga_ie: Lean na Treoracha chun Pandoc a Shuiteáil/a Nuashonrú

source: Export Failed
ga_ie: Theip ar an Easpórtáil

source: Import Failed
ga_ie: Theip ar an allmhairiú

source: Generated Image too Large
ga_ie: Íomhá Ginithe ró-mhór

source: Failed to export file to <em>{0}</em>
ga_ie: Theip ar easpórtáil an chomhaid chuig <em>{0}</em>

source: Failed to import file from <em>{0}</em>
ga_ie: Theip ar chomhad a iompórtáil ó <em>{0}</em>

source: File does not exist at <em>{0}</em>
ga_ie: Níl an comhad ann ag <em>{0}</em>

source: Export to...
ga_ie: Easpórtáil chuig...

source: Do you want to save the changes made to this document ?<br> Your changes will be lost if you don't save them.
ga_ie: Ar mhaith leat na hathruithe a rinneadh ar an doiciméad seo a shábháil?<br> Caillfear do chuid athruithe mura sábhálann tú iad.

source: [Warning] Failed to attach bookmark for PDF file.
ga_ie: [Rabhadh] Theip ar leabharmharc a cheangal le haghaidh comhad PDF.

source: Dark Theme not support
ga_ie: Ní thacaítear le Téama Dorcha

source: Sorry, current version of Typora won't print background color on exported PDF, So dark theme is not yet supported for PDF exporting. Please choose a light theme or click "Print with default theme"
ga_ie: Tá brón orm, ní phriontálann an leagan reatha de Typora dath cúlra ar PDF easpórtáilte, mar sin níl tacaíocht ann don téama dorcha fós le haghaidh easpórtáil PDF. Roghnaigh téama éadrom nó cliceáil "Priontáil leis an téama réamhshocraithe"

source: Print with default theme
ga_ie: Priontáil leis an téama réamhshocraithe

source: Export to PDF successfully.
ga_ie: Easpórtáil go PDF go rathúil.

source: Converting file using Pandoc. This may take some time.
ga_ie: Ag tiontú comhaid ag baint úsáide as Pandoc. D’fhéadfadh sé seo roinnt ama a thógáil.

source: Exporting file using Pandoc. This may take some time.
ga_ie: Ag easpórtáil comhaid ag baint úsáide as Pandoc. D’fhéadfadh sé seo roinnt ama a thógáil.

source: Uploading in progress…
ga_ie: Ag uaslódáil ar siúl…

source: Do not show this again
ga_ie: Ná taispeáin seo arís

source: Minute
ga_ie: Nóiméad

source: Line
ga_ie: Líne

source: Word
ga_ie: Focal

source: Character
ga_ie: Carachtar

source: Minutes
ga_ie: Nóiméid

source: Lines
ga_ie: Línte

source: Words
ga_ie: Focail

source: Characters
ga_ie: Carachtair

source: In Selection
ga_ie: Sa Roghnú

source: Panel
ga_ie: Painéal

source: Appearance
ga_ie: Dealramh

source: System Native
ga_ie: Córas Dúchasach

source: Unibody
ga_ie: Aonchorp

source: (applied after restart)
ga_ie: (curtha i bhfeidhm tar éis atosaithe)

source: Status Bar
ga_ie: Barra Stádais

source: Show status bar
ga_ie: Taispeáin barra stádais

source: Save & Recover
ga_ie: Sábháil & Aisghabháil

source: Auto Save
ga_ie: Sábháil Uathoibríoch

source: Recover Unsaved Drafts
ga_ie: Aisghabháil Dréachtaí Gan Sábháil

source: Emoji Autocomplete
ga_ie: Uathchríochnú Emoji

source: Trigger by ESC key
ga_ie: Truicear le eochair ESC

source: Trigger automatically
ga_ie: Truicear go huathoibríoch

source: Default Line Ending
ga_ie: Deireadh Líne Réamhshocraithe

source: Line ending for new file
ga_ie: Deireadh líne le haghaidh comhad nua

source: Spell Check
ga_ie: Seiceáil Litrithe

source: Auto correct spelling
ga_ie: Litriú uathoibríoch ceartúcháin

source: System
ga_ie: Córas

source: Privacy
ga_ie: Príobháideacht

source: Developer
ga_ie: Forbróir

source: Update
ga_ie: Nuashonrú

source: Check Updates
ga_ie: Seiceáil Nuashonruithe

source: Check updates automatically
ga_ie: Seiceáil nuashonruithe go huathoibríoch

source: Advanced Settings
ga_ie: Socruithe Ardleibhéil

source: Open Advanced Settings
ga_ie: Oscail Socruithe Ardleibhéil

source: Reset Advanced Settings
ga_ie: Athshocraigh Socruithe Ardleibhéil

source: This function requires latest version of iPic to be installed.
ga_ie: Éilíonn an fheidhm seo an leagan is déanaí de iPic a shuiteáil.

source: Get iPic
ga_ie: Faigh iPic

source: Cannot Continue…
ga_ie: Ní féidir leanúint ar aghaidh…

source: This feature require macOS >= 10.11
ga_ie: Éilíonn an ghné seo macOS >= 10.11

source: One More Step
ga_ie: Céim amháin eile

source: Notice
ga_ie: Fógra

source: %d Images Failed to Upload.
ga_ie: Theip ar %d Íomhá a Uaslódáil.

source: %d Succeeded,
ga_ie: %d D'éirigh leis,

source: Enable this feature on preferences panel
ga_ie: Cumasaigh an ghné seo ar an bpainéal roghanna

source: The option `%@` must be enabled first to automatically upload images.
ga_ie: Ní mór an rogha `%@` a chumasú ar dtús chun íomhánna a uaslódáil go huathoibríoch.

source: %@ is a file, not a directory
ga_ie: Is comhad é %@, ní eolaire

source: Copy Images To…
ga_ie: Cóipeáil Íomhánna Chuig…

source: Typora are trying copy the newly inserted image to folder %@ according to your YAML Front Matter setting or global preferences. But the target folder does not exist, create it now?
ga_ie: Tá Typora ag iarraidh an íomhá nua-churtha isteach a chóipeáil chuig an bhfillteán %@ de réir do shocruithe YAML Front Matter nó do chuid sainroghanna domhanda. Ach níl an fillteán sprice ann, cruthaigh é anois?

source: Create Folder and Continue
ga_ie: Cruthaigh Fillteán agus Lean ar aghaidh

source: Document must be saved first
ga_ie: Ní mór an doiciméad a shábháil ar dtús

source: Typora will copy newly inserted image to folder by selected relative path, so please save save the file first.
ga_ie: Déanfaidh Typora an íomhá nua-churtha isteach a chóipeáil chuig an bhfillteán tríd an gcosán coibhneasta roghnaithe, mar sin sábháil an comhad ar dtús le do thoil.

source: Open Operation Failed
ga_ie: Theip ar an Oibríocht Oscailte

source: Support Documentation
ga_ie: Doiciméadacht Tacaíochta

source: Markdown File
ga_ie: Comhad Markdown

source: Plain Text File
ga_ie: Comhad Téacs Gnáth

source: All Files
ga_ie: Gach Comhad

source: All Supported Formats
ga_ie: Gach Formáid Tacaithe

source: Discard Changes
ga_ie: Scrios Athruithe

source: Discard
ga_ie: Caith uait

source: Menu
ga_ie: Roghchlár

source: Back
ga_ie: Ar ais

source: Contact
ga_ie: Teagmháil

source: Open From...
ga_ie: Oscailte Ó...

source: Import...
ga_ie: Iompórtáil...

source: Recent Documents
ga_ie: Doiciméid Le Déanaí

source: Search for
ga_ie: Cuardaigh

source: Clear Recent Documents
ga_ie: Glan Doiciméid Le Déanaí

source: File Name
ga_ie: Ainm Comhaid

source: Path
ga_ie: Cosán

source: Export As...
ga_ie: Easpórtáil Mar...

source: More Formats
ga_ie: Tuilleadh Formáidí

source: File formats under 'More Formats' sections needs <a class='open-pandoc-guide'>Pandoc to be installed</a>.
ga_ie: Ní mór <a class='open-pandoc-guide'>Pandoc a shuiteáil</a> le haghaidh formáidí comhaid faoi na rannóga 'Tuilleadh Formáidí'.

source: Something is Wrong…
ga_ie: Tá rud éigin mícheart…

source: Save content failed for some reason.<br/>You could copy the content into a new Typora window, and then save it. <br/>Learn more about:<ul><li><a href='https://support.typora.io/Report-Bugs/'>Report bugs to us</a></li><li><a href='https://support.typora.io/Version-Control/'>Recover lost contents</a></li></ul>
ga_ie: Theip ar ábhar a shábháil ar chúis éigin.<br/>D’fhéadfá an t-ábhar a chóipeáil isteach i bhfuinneog nua Typora, agus ansin é a shábháil. <br/>Faigh tuilleadh eolais faoi:<ul><li><a href='https://support.typora.io/Report-Bugs/'>Tuairiscigh fabhtanna dúinn</a></li><li><a href='https://support.typora.io/Version-Control/'>Aisghabháil ábhar caillte</a></li></ul>

source: Copy Content
ga_ie: Cóipeáil Ábhar

source: Total
ga_ie: Iomlán

source: Word count only support OS X later than 10.10.
ga_ie: Ní thacaíonn comhaireamh focal ach le OS X níos déanaí ná 10.10.

source: Indent Size for Code
ga_ie: Méid Eangaithe don Chód

source: Auto wrap long lines
ga_ie: Línte fada fillte go huathoibríoch

source: Sorry, current version of Typora won't print background color. So dark theme is not yet supported for printing. Please choose a light theme or export this document to PDF.
ga_ie: Tá brón orm, ní phriontálann an leagan reatha de Typora dath cúlra. Mar sin, níl tacaíocht ann don téama dorcha le haghaidh priontála go fóill. Roghnaigh téama éadrom nó easpórtáil an doiciméad seo go PDF le do thoil.

source: Export to PDF
ga_ie: Easpórtáil go PDF

source: Pretty indentation
ga_ie: Eangú deas

source: Update markdown reference for this image
ga_ie: Nuashonraigh tagairt marcála síos don íomhá seo

source: No special action
ga_ie: Gan aon ghníomh speisialta

source: Copy image to current folder (./)
ga_ie: Cóipeáil íomhá chuig an bhfillteán reatha (./)

source: Copy image to ./assets
ga_ie: Cóipeáil íomhá chuig ./assets

source: Copy image to ./${filename}.assets
ga_ie: Cóipeáil íomhá chuig ./${filename}.assets

source: Apply above rules to local images
ga_ie: Cuir na rialacha thuas i bhfeidhm ar íomhánna áitiúla

source: Apply above rules to online images
ga_ie: Cuir na rialacha thuas i bhfeidhm ar íomhánna ar líne

source: Allow upload images automatically based on YAML settings
ga_ie: Ceadaigh íomhánna a uaslódáil go huathoibríoch bunaithe ar shocruithe YAML

source: Learn More
ga_ie: Foghlaim Tuilleadh

source: Whitespace / Line Break
ga_ie: Spás Bán / Briseadh Líne

source: When Writing
ga_ie: Agus tú ag Scríobh

source: Export / Print
ga_ie: Easpórtáil / Priontáil

source: Preserve sequential whitespace and single line break
ga_ie: Coinnigh spás bán agus sos líne aonair

source: Ignore sequential whitespace and single line break
ga_ie: Déan neamhaird de spás bán agus briseadh líne aonair

source: Quit
ga_ie: Scoir

source: Quit Typora when last window is closed
ga_ie: Scoir Typora nuair a bhíonn an fhuinneog dheireanach dúnta

source: On Launch
ga_ie: Ar an Seoladh

source: Open new file
ga_ie: Oscail comhad nua

source: Restore last closed folders
ga_ie: Athchóirigh na fillteáin dheireanacha a dúnadh

source: Restore last closed files and folders
ga_ie: Athchóirigh na comhaid agus na fillteáin dheireanacha a dúnadh

source: Open custom folder
ga_ie: Oscail fillteán saincheaptha

source: Select custom folder
ga_ie: Roghnaigh fillteán saincheaptha

source: This option may be overridden by "Close windows when quitting an application" in System Preferences
ga_ie: Féadfar an rogha seo a shárú le "Dún fuinneoga agus feidhmchlár á scor" i Roghanna an Chórais

source: Ignore
ga_ie: Déan neamhaird de

source: Choose Default Folder
ga_ie: Roghnaigh Fillteán Réamhshocraithe

source: <div><strong>Convert on Input</strong>: Input ASCII dashes or quotes, converted and saved as curly quotes or unicode dashes.<br/><strong>Convert on Rendering</strong>: Input and saved as ASCII dashes or quotes, render as curly quotes or unicode dashes.</div>
ga_ie: <div><strong>Tiontaigh ar Ionchur</strong>: Cuir isteach fleascáin nó comharthaí athfhriotail ASCII, tiontaithe agus sábháilte mar chomharthaí athfhriotail chatacha nó fleascáin unicode.<br/><strong>Tiontaigh ar Rindreáil</strong>: Cuir isteach agus sábháil mar fhleascáin nó comharthaí athfhriotail ASCII, rindreáil mar chomharthaí athfhriotail chatacha nó fleascáin unicode.</div>

source: <div>Recognize unicode punctuations as ASCII ones when parse markdown, e.g:<br/> <pre> 》 blockquote → > blockquote <br/> [link](src ’title’) → [link](src 'title')</pre>It will be turned on automatically if smart quotes/dashes will be converted on input.<div>
ga_ie: <div>Aithnigh poncaíochtaí unicode mar poncaíochtaí ASCII agus marcáil síos á pharsáil, m.sh.:<br/> <pre> 》 blockquote → > blockquote <br/> [link](src ’title’) → [link](src ’title’)</pre>Cuirfear ar siúl é go huathoibríoch má dhéantar comharthaí athfhriotail/fleascáin chliste a thiontú ar ionchur.<div>

source: Copy image to custom folder
ga_ie: Cóipeáil íomhá chuig fillteán saincheaptha

source: Please specify a relative path to current folder which begins with './' or '../', or an absolute folder path. (`${filename}` representing for currents filename.)
ga_ie: Sonraigh cosán coibhneasta chuig an bhfillteán reatha a thosaíonn le './' nó '../', nó cosán absalóideach fillteáin. (`${filename}` a léiríonn ainm comhaid reatha.)

source: Restore to previous setting
ga_ie: Athchóirigh chuig an socrú roimhe seo

source: Folder not exist at %@, please input another path.
ga_ie: Níl an fillteán ann ag %@, cuir isteach cosán eile le do thoil.

source: Please input a folder path.
ga_ie: Cuir isteach cosán fillteáin le do thoil.

source: Cannot use root path.
ga_ie: Ní féidir an cosán fréimhe a úsáid.

source: Get Themes
ga_ie: Faigh Téamaí

source: File/directory already exists at target path.
ga_ie: Tá comhad/eolaire ann cheana féin ag an gcosán sprice.

source: Keep Both
ga_ie: Coinnigh an dá cheann

source: Are you sure you want to move %@?
ga_ie: An bhfuil tú cinnte gur mian leat %@ a bhogadh?

source: Are you sure you want to delete %@?
ga_ie: An bhfuil tú cinnte gur mian leat %@ a scriosadh?

source: You can restore from the Trash.
ga_ie: Is féidir leat é a athchóiriú ón mBruscar.

source: Reset All Dialog Warnings
ga_ie: Athshocraigh Gach Rabhadh Dialóige

source: Dialogs
ga_ie: Dialóga

source: Dialog warnings have been reset.
ga_ie: Tá rabhaidh dialóige athshocraithe.

source: Operation Failed
ga_ie: Theip ar an Oibríocht

source: Failed to move target file or folder to trash
ga_ie: Theip ar an gcomhad nó an fillteán sprice a bhogadh chuig an mbruscar

source: Undo %@
ga_ie: Cuir ar ceal %@

source: Copy %@
ga_ie: Cóipeáil %@

source: Move %@
ga_ie: Bog %@

source: Delete %@
ga_ie: Scrios %@

source: Turn off Typewriter / Focus Mode
ga_ie: Múch Mód Clóscríbhneora / Fócais

source: Typewriter / Focus Mode have been turned off.
ga_ie: Tá Mód Clóscríbhneora / Fócais múchta.

source: Reading Speed
ga_ie: Luas Léitheoireachta

source: Auto
ga_ie: Uathoibríoch

source: words / min
ga_ie: focail / nóiméad

source: Reset to Default
ga_ie: Athshocraigh go Réamhshocrú

source: 120 words/minute (Slow)
ga_ie: 120 focal/nóiméad (Mall)

source: 240 words/minute (Medium)
ga_ie: 240 focal/nóiméad (Meánach)

source: 382 words/minute (Fast)
ga_ie: 382 focal/nóiméad (Gasta)

source: Copy and update image source to…
ga_ie: Cóipeáil agus nuashonraigh foinse na híomhá chuig…

source: Updater
ga_ie: Nuashonraitheoir

source: Install Updates ?
ga_ie: Nuashonruithe a shuiteáil?

source: Quit and Install
ga_ie: Scoir agus Suiteáil

source: Download failed
ga_ie: Theip ar an íoslódáil

source: Downloading Updates…
ga_ie: Nuashonruithe á n-íoslódáil…

source: Checking Updates…
ga_ie: Ag Seiceáil Nuashonruithe…

source: Check Update Failed
ga_ie: Theip ar an Nuashonrú Seiceála

source: You're up to date!
ga_ie: Tá tú suas chun dáta!

source: Latest version is $1, your version is $2
ga_ie: Is é $1 an leagan is déanaí, is é $2 do leagan féin

source: These options can also be changed under "Edit→Whitespace and Line Breaks" menu
ga_ie: Is féidir na roghanna seo a athrú freisin faoin roghchlár "Eagar→Spás Bán agus Briseadh Líne"

source: Auto escape image URL when insert
ga_ie: URL íomhá uathoibríoch éalaithe nuair a chuirtear isteach é

source: For example, if you insert a file at 'img/example file.png', it will become 'img/example%20file.png'. Enable this for better compatibility with other Markdown engines, or disable this for better readability.
ga_ie: Mar shampla, má chuireann tú comhad isteach ag 'img/example file.png', beidh sé ina 'img/example%20file.png'. Cumasaigh é seo le haghaidh comhoiriúnachta níos fearr le hinnill Markdown eile, nó díchumasaigh é seo le haghaidh inléiteachta níos fearr.

source: Skip This Version
ga_ie: Scipeáil ar an Leagan Seo

source: Remind Me Later
ga_ie: Cuir i gcuimhne dom níos déanaí

source: Download Update
ga_ie: Íoslódáil Nuashonrú

source: New version available.
ga_ie: Leagan nua ar fáil.

source: When copy / export as HTML (without style)
ga_ie: Nuair a chóipeáiltear/a easpórtáiltear mar HTML (gan stíl)

source: Use Rendered SVG
ga_ie: Úsáid SVG Rindreáilte

source: Use LaTeX Source
ga_ie: Úsáid Foinse LaTeX

source: <div>Take effects when export as HTML (without styles) or copy as HTML code, or copy without theme style.<br/>When <strong>Use LaTeX Source</strong> is selected, Typora will put the raw LaTeX source (e.g: $X^2$),<br/>When <strong>Use Rendered SVG</strong> is selected, the rendered SVG will be used, if you paste to other app, SVG may get ignored.</div>
ga_ie: <div>Glac éifeachtaí nuair a dhéantar onnmhairiú mar HTML (gan stíleanna) nó cóipeáil mar chód HTML, nó cóipeáil gan stíl téama.<br/>Nuair a roghnaítear <strong>Úsáid Foinse LaTeX</strong>, cuirfidh Typora an fhoinse LaTeX amh (m.sh.: $X^2$) i bhfeidhm.<br/>Nuair a roghnaítear <strong>Úsáid SVG Rindreáilte</strong>, úsáidfear an SVG rindreáilte. Má ghreamaíonn tú chuig aip eile, d'fhéadfaí neamhaird a dhéanamh de SVG.</div>

source: Import function and several export formats requires Pandoc (≥%@) to be installed.
ga_ie: Éilíonn feidhm allmhairithe agus roinnt formáidí easpórtála go mbeidh Pandoc (≥%@) suiteáilte.

source: Do not show this message again
ga_ie: Ná taispeáin an teachtaireacht seo arís

source: Page Break Between Top Headings
ga_ie: Briseadh Leathanaigh Idir na Ceannteidil is Fearr

source: Sorry, some error happened, current writing content has been copied to clipboard. You could report this to <hi@typora.io> to help us fix this error.
ga_ie: Tá brón orm, tharla earráid éigin, tá an t-ábhar scríbhneoireachta reatha cóipeáilte chuig an ghearrthaisce. Is féidir leat é seo a thuairisciú do <hi@typora.io> chun cabhrú linn an earráid seo a shocrú.

source: Try Recovery
ga_ie: Bain triail as Aisghabháil

source: Other Options for Data Recovery
ga_ie: Roghanna Eile le haghaidh Aisghabhála Sonraí

source: When Insert
ga_ie: Nuair a Ionsáigh
