Repository: sponka9/Typora-i18n
Catalog: *.lproj/Panel.strings
Languages: ga_ie

source: Upload image
ga_ie: Uaslódáil íomhá

source: e.g: %@
ga_ie: m.sh.: %@

source: Test Uploader
ga_ie: Uaslódálaí Tástála

source: Validating
ga_ie: Ag bailíochtú uaslódálaí íomhánna

source: Validation Failed
ga_ie: Theip ar an mBailíochtú

source: Validation Succeed
ga_ie: Bailíochtú Rathúil

source: Testing image uploading using command:
ga_ie: Tástáil uaslódáil íomhá ag baint úsáide as an ordú:

source: Running… Waiting for results.
ga_ie: Ag rith… Ag fanacht le torthaí.

source: Output from the console:
ga_ie: Aschur ón gconsól:

source: Error from the console:
ga_ie: Earráid ón gconsól:

source: Failed to fetch uploaded image from command output.
ga_ie: Theip ar íomhá uaslódáilte a fháil ó aschur an ordaithe.

source: Successfully get uploaded image url.
ga_ie: Uaslódáileadh url na híomhá go rathúil.

source: Image Uploader
ga_ie: Uaslódálaí Íomhá

source: Instructions
ga_ie: Treoracha

source: Download %@
ga_ie: Íoslódáil %@

source: Image Upload Setting
ga_ie: Socrú Uaslódála Íomhá

source: Please set an image uploader in Preferences panel before using this function.
ga_ie: Socraigh uaslódálaí íomhá sa phainéal Roghanna sula n-úsáideann tú an fheidhm seo.

source: Download or Upgrade
ga_ie: Íoslódáil nó Uasghrádú

source: Open Config File
ga_ie: Oscail Comhad Cumraíochta

source: Command
ga_ie: Ordú

source: PicGo Path
ga_ie: Cosán PicGo

source: Path of PicGo binary
ga_ie: Cosán dénártha PicGo

source: Executable
ga_ie: Inrite

source: Checking
ga_ie: Ag seiceáil

source: Download
ga_ie: Íoslódáil

source: Agree and Download
ga_ie: Aontaigh agus Íoslódáil

source: Download and Reinstall
ga_ie: Íoslódáil agus Athshuiteáil

source: Loading PicGo-Core License
ga_ie: Ag luchtú Ceadúnas PicGo-Core

source: Failed to get installed version of PicGo-Core (command line)
ga_ie: Theip ar leagan suiteáilte de PicGo-Core (líne ordaithe) a fháil

source: You have the latest PicGo-Core (CLI)
ga_ie: Tá an leagan is déanaí de PicGo-Core (CLI) agat

source: Newer version is available
ga_ie: Tá leagan níos nuaí ar fáil

source: Downloading…
ga_ie: Ag íoslódáil…

source: Unzipping…
ga_ie: Ag dízipeáil…

source: Finished
ga_ie: Críochnaithe

source: Typora will launch 3rd party app with file paths of all local images. The image uploader and cloud image storage will then have access to your local images. Are you sure to continue?
ga_ie: Seolfaidh Typora aip tríú páirtí le cosáin chomhaid na n-íomhánna áitiúla go léir. Beidh rochtain ag an uaslódálaí íomhánna agus ag an stóras íomhánna scamall ar d’íomhánna áitiúla ansin. An bhfuil tú cinnte leanúint ar aghaidh?

source: Export operation finished successfully.
ga_ie: Críochnaíodh an oibríocht easpórtála go rathúil.

source: Shortcut Keys
ga_ie: Eochracha Aicearra

source: Custom Shortcut Keys
ga_ie: Eochracha Aicearra Saincheaptha

source: Theme
ga_ie: Téama

source: Light Theme
ga_ie: Téama Éadrom

source: Dark Theme
ga_ie: Téama Dorcha

source: Use separate theme in dark mode
ga_ie: Úsáid téama ar leithligh i mód dorcha

source: Supported on macOS ≥ 10.15 or Windows 10 ≥ 1903
ga_ie: Tacaithe ar macOS ≥ 10.15 nó Windows 10 ≥ 1903

source: Convert -- to – (en dash), and --- to — (em dash)
ga_ie: Tiontaigh -- go – (fleascán en), agus --- go — (fleascán em)

source: Convert -- and --- to — (em dash)
ga_ie: Tiontaigh -- agus --- go — (fleasc em)

source: You could set quote patterns in System Preferences → Keyboard → Text. If it is changed, Typora will need a restart to apply it.
ga_ie: D’fhéadfá patrúin athfhriotail a shocrú i Roghanna Córais → Méarchlár → Téacs. Má athraítear é, beidh atosú ag teastáil ó Typora chun é a chur i bhfeidhm.

source: Paper Size
ga_ie: Méid Páipéir

source: US Letter
ga_ie: Litir SAM

source: US Legal
ga_ie: Dlí SAM

source: Tabloid
ga_ie: Tablóid

source: Page Break
ga_ie: Briseadh Leathanaigh

source: Header
ga_ie: Ceanntásc

source: Footer
ga_ie: Buntásc

source: Author
ga_ie: Údar

source: Append in <head />
ga_ie: Cuir i <head />

source: Append in <body />
ga_ie: Cuir i <body />

source: Include Outline Sidebar
ga_ie: Cuir Barra Taobh Imlíne san áireamh

source: Width
ga_ie: Leithead

source: Show Save File Dialog
ga_ie: Taispeáin an Dialóg Sábháil Comhad

source: File Extensions for Export
ga_ie: Síneadh Comhad le haghaidh Easpórtála

source: Arguments
ga_ie: Argóintí

source: Extra Arguments
ga_ie: Argóintí Breise

source: LaTeX Engine
ga_ie: Inneall LaTeX

source: Template
ga_ie: Teimpléad

source: Empty
ga_ie: Folamh

source: Style Reference
ga_ie: Tagairt Stíle

source: Custom CSS
ga_ie: CSS saincheaptha

source: Chapter Level
ga_ie: Leibhéal Caibidle

source: Default Folder for Exported File
ga_ie: Fillteán Réamhshocraithe le haghaidh Comhad Easpórtáilte

source: Same folder with current file
ga_ie: Fillteán céanna leis an gcomhad reatha

source: Custom location
ga_ie: Suíomh saincheaptha

source: (Auto Detect)
ga_ie: (Braith Uathoibríoch)

source: After Export
ga_ie: Tar éis Easpórtála

source: Open exported file location
ga_ie: Oscail suíomh an chomhaid onnmhairithe

source: Open exported file
ga_ie: Oscail an comhad easpórtáilte

source: Custom
ga_ie: Saincheaptha

source: None
ga_ie: Dada

source: Default
ga_ie: Réamhshocrú

source: Margin
ga_ie: Corrlach

source: Margin Left
ga_ie: Corrlach Clé

source: Margin Right
ga_ie: Corrlach Dheis

source: Margin Top
ga_ie: Corrlach Barr

source: Margin Bottom
ga_ie: Corrlach Bun

source: Width x Height
ga_ie: Leithead x Airde

source: Add From a Template
ga_ie: Cuir leis ó Theimpléad

source: Delete this export option ?
ga_ie: Scrios an rogha easpórtála seo?

source: Add
ga_ie: Cuir leis

source: Delete
ga_ie: Scrios

source: Rename
ga_ie: Athainmnigh

source: Move Down
ga_ie: Bog Síos

source: Move Up
ga_ie: Bog Suas

source: Pandoc Path
ga_ie: Cosán Pandoc

source: Select
ga_ie: Roghnaigh

source: Target Format
ga_ie: Formáid Sprioc

source: auto detect based on target file path
ga_ie: braiteadh uathoibríoch bunaithe ar chonair chomhaid sprice

source: Target File Extensions (separate by whitespace)
ga_ie: Síneadh Comhad Spriocdhírithe (scartha le spás bán)

source: e.g: .text .asciidoc or leave this empty
ga_ie: m.sh.: .text .asciidoc nó fág folamh é seo

source: Raw Type
ga_ie: Cineál Amh

source: Do not popup save file dialog
ga_ie: Ná cuir aníos an dialóg sábháil comhaid

source: Select file path to save
ga_ie: Roghnaigh cosán comhaid le sábháil

source: Select folder path to save
ga_ie: Roghnaigh cosán fillteáin le sábháil

source: PDF Engine
ga_ie: Inneall PDF

source: Show command output
ga_ie: Taispeáin aschur an ordaithe

source: "Export and Overwrite with Previous" will overwrite file at %@, would you continue?
ga_ie: Scríobhfaidh "Easpórtáil agus Forscríobh leis an Roimhe Seo" an comhad ag %@, an leanfá ar aghaidh?

source: Command Arguments:
ga_ie: Argóintí Ordaithe:

source: This dev version of Typora is expired, please download and install a newer version.
ga_ie: Tá an leagan forbartha seo de Typora imithe in éag, íoslódáil agus suiteáil leagan níos nuaí le do thoil.

source: Current Theme
ga_ie: Téama Reatha

source: Run command
ga_ie: Rith an t-ordú

source: Run command after export failed
ga_ie: Rith ordú tar éis theip ar an easpórtáil

source: Read and overwrite export settings from YAML front matters
ga_ie: Léigh agus athscríobh socruithe easpórtála ó chúrsaí tosaigh YAML

source: Append Extra Content (HTML)
ga_ie: Cuir Ábhar Breise (HTML) leis

source: Change this option to specify a separated theme for export.
ga_ie: Athraigh an rogha seo chun téama scartha a shonrú le haghaidh easpórtála.

source: Dark theme is not supported.
ga_ie: Ní thacaítear leis an téama dorcha.

source: Markdown Variants
ga_ie: Malartacha Lascaine

source: Original Unextended Markdown
ga_ie: Marcáil Anuas Gan Leathnú Bunaidh

source: CommonMark with many pandoc extensions
ga_ie: CommonMark le go leor síntí pandoc

source: Line Wrap
ga_ie: Fillteán Líne

source: Hard line wrap
ga_ie: Timfhilleadh líne chrua

source: Text Column Width
ga_ie: Leithead Colún Téacs

source: Auto (based on current OS)
ga_ie: Uathoibríoch (bunaithe ar an gcóras oibriúcháin reatha)

source: Indent
ga_ie: Eangaigh

source: Preserve tabs
ga_ie: Caomhnaigh na cluaisíní

source: 2 spaces per tab
ga_ie: 2 spás in aghaidh an chluaisín

source: 3 spaces per tab
ga_ie: 3 spás in aghaidh an chluaisín

source: 4 spaces per tab
ga_ie: 4 spás in aghaidh an chluaisín

source: Unicode Characters
ga_ie: Carachtair Unicode

source: Use only ASCII characters in output
ga_ie: Ná húsáid ach carachtair ASCII san aschur

source: Use reference-style links rather than inline links
ga_ie: Bain úsáid as naisc i stíl tagartha seachas naisc inlíne

source: Footnotes and References Location
ga_ie: Nótaí Cos agus Tagairtí Suíomh

source: End of document
ga_ie: Deireadh an doiciméid

source: End of current (top-level) block
ga_ie: Deireadh an bhloic reatha (barr-leibhéal)

source: End of current section
ga_ie: Deireadh na coda reatha

source: Convert TeX formulas to web images
ga_ie: Tiontaigh foirmlí TeX go híomhánna gréasáin

source: Image Format
ga_ie: Formáid Íomhá

source: Set Pandoc Path
ga_ie: Socraigh Cosán Pandoc

source: Apply Line Break at \ and &#92;newline
ga_ie: Cuir Briseadh Líne i bhfeidhm ag \ agus &#92;líne nua

source: Export operation succeeded with warnings.
ga_ie: D’éirigh leis an oibríocht easpórtála ach tugadh rabhaidh.

source: Typora is now deactivated
ga_ie: Tá Typora díghníomhachtaithe anois

source: This device has been deactivated
ga_ie: Tá an gléas seo díghníomhachtaithe

source: UNREGISTERED
ga_ie: NEAMHCHLÁRAITHE

source: Your Typora is not activated.
ga_ie: Níl do Typora gníomhachtaithe.

source: Your Typora has been activated.
ga_ie: Tá do Typora gníomhachtaithe.

source: Typora activation is required to change this.
ga_ie: Tá gníomhachtú Typora ag teastáil chun seo a athrú.

source: You can reinstall the stable version and then disable this.
ga_ie: Is féidir leat an leagan cobhsaí a athshuiteáil agus ansin é seo a dhíchumasú.

source: Update to dev version
ga_ie: Nuashonrú chuig leagan an fhorbróra

source: Typora Server
ga_ie: Freastalaí Typora

source: Use Typora Server in China
ga_ie: Bain úsáid as Freastalaí Typora sa tSín

source: File does not exist
ga_ie: Níl an comhad ann

source: Create File
ga_ie: Cruthaigh Comhad

source: Create Folder
ga_ie: Cruthaigh Fillteán

source: (Some options will be applied after restart.)
ga_ie: (Cuirfear roinnt roghanna i bhfeidhm tar éis atosaithe.)

source: Copy or cut the whole lines that have cursors on them, if there is no selection when doing copy / cut.
ga_ie: Cóipeáil nó gearr na línte iomlána a bhfuil cúrsóirí orthu, mura bhfuil aon rogha ann agus cóipeáil/gearradh á dhéanamh.

source: Enable physics package
ga_ie: Cumasaigh pacáiste fisice

source: Physics package will redefine some latex macros, such as \div, \Re, etc.
ga_ie: Athshaineoidh an pacáiste fisice roinnt macraí laitéis, amhail \div, \Re, srl.

source: Detail
ga_ie: Sonra

source: Use custom font size
ga_ie: Úsáid méid cló saincheaptha

source: Use theme font size
ga_ie: Úsáid méid cló an téama

source: You are using the Snap version, it may have limited access to your local executables.
ga_ie: Tá tú ag úsáid an leagan Snap, d'fhéadfadh rochtain theoranta a bheith aige ar do chomhaid inrite áitiúla.

source: No local images found.
ga_ie: Níor aimsíodh aon íomhánna áitiúla.

source: File Format:
ga_ie: Formáid Comhaid:

source: Images copied to %@.
ga_ie: Íomhánna cóipeáilte chuig %@.

source: Images moved to %@.
ga_ie: Íomhánna bogtha go %@.

source: Custom Command
ga_ie: Ordú Saincheaptha

source: No Automatic Equation Numbering
ga_ie: Gan Uimhriú Cothromóidí Uathoibríoch

source: Use AMS Numbering Rules
ga_ie: Úsáid Rialacha Uimhrithe AMS

source: Auto Numbering for All Math Equations
ga_ie: Uimhriú Uathoibríoch do Gach Cothromóid Matamaitice

source: Preferred Image Syntax
ga_ie: Comhréir Íomhá is Fearr

source: Add ./ for relative path
ga_ie: Cuir ./ leis le haghaidh cosáin choibhneasta

source: When enabled, Typora will use pattern like ./assets/image.png instead of assets/image.png when generating relative path for inserted images.
ga_ie: Nuair a bheidh sé cumasaithe, úsáidfidh Typora patrún cosúil le ./assets/image.png in ionad assets/image.png agus cosán coibhneasta á ghiniúint le haghaidh íomhánna a cuireadh isteach.

source: Image Quality
ga_ie: Cáilíocht Íomhá

source: Medium
ga_ie: Meánach

source: High
ga_ie: Ard

source: Best
ga_ie: Is Fearr

source: Use Shift+Tab to auto indent selected code
ga_ie: Úsáid Shift+Tab chun an cód roghnaithe a ionchorprú go huathoibríoch

source: When disabled, Shift+Tab will outdent selected code or current line. When enabled, Shift+Tab will auto apply indentation for selected code or current line in code blocks.
ga_ie: Nuair a bhíonn sé díchumasaithe, cuirfidh Shift+Tab eangú i bhfeidhm go huathoibríoch ar an gcód roghnaithe nó ar an líne reatha i mbloic chóid.

source: Auto Links (e.g: https://typora.io)
ga_ie: Naisc Uathoibríocha (m.sh.: https://typora.io)

source: When enabled, Typora will auto recognize and highlight URLs (e.g: https://typora.io or mailto:hi@typora.io) in text.
ga_ie: Nuair a bheidh sé cumasaithe, aithneoidh agus airdeoidh Typora URLanna go huathoibríoch (e.g.: https://typora.io nó mailto:hi@typora.io) sa téacs.

source: Files
ga_ie: Comhaid

source: Default File Type / Extension
ga_ie: Cineál Comhaid Réamhshocraithe / Síneadh

source: Custom Extension:
ga_ie: Síneadh Saincheaptha:

source: Following extensions are supported: %@
ga_ie: Tacaítear leis na síntí seo a leanas: %@

source: When drop file / folder into Typora
ga_ie: Nuair a scaoileann tú comhad / fillteán isteach i Typora

source: When drop folder
ga_ie: Nuair a scaoileann tú fillteán

source: When drop markdown file
ga_ie: Nuair a scaoileann tú comhad marcála síos

source: When drop files that can be imported
ga_ie: Nuair a scaoileann tú comhaid is féidir a allmhairiú

source: Open in Typora
ga_ie: Oscailte i Typora

source: Insert Folder Link
ga_ie: Cuir Nasc Fillteáin Isteach

source: Insert File Link
ga_ie: Cuir Nasc Comhaid isteach

source: Import File
ga_ie: Iompórtáil Comhad

source: Diagram Options
ga_ie: Roghanna Léaráide

source: Default Code Language
ga_ie: Teanga Cód Réamhshocraithe

source: (None)
ga_ie: (Dada)

source: Last Used
ga_ie: Úsáidte Deiridh

source: Apply Default Code Language When
ga_ie: Cuir Teanga Cód Réamhshocraithe i bhFeidhm Nuair

source: When add code fences via Markdown
ga_ie: Nuair a chuirtear fálta cóid leis trí Markdown

source: When add code fences via Menubar
ga_ie: Nuair a chuirtear fálta cóid leis tríd an mBarra Roghchláir

source: Both
ga_ie: An dá cheann

source: Pinned and Recent Locations
ga_ie: Pionnáilte agus Suímh le Déanaí

source: Operation Succeeded
ga_ie: D'éirigh leis an Oibríocht

source: Clear Recent Folders and Files
ga_ie: Glan Fillteáin agus Comhaid Le Déanaí

source: Clear Recent Folders / Files Only
ga_ie: Glan Fillteáin/Comhaid Le Déanaí Amháin

source: Clear Recent and Pinned Folders / Files
ga_ie: Glan Fillteáin/Comhaid Le Déanaí agus Priontáilte

source: Also clear pinned folders
ga_ie: Glan an fillteán bioráilte freisins

source: Pin
ga_ie: Pionnaigh

source: Unpin
ga_ie: Díphionnaigh

source: Remove from List
ga_ie: Bain den Liosta

source: Record recent files and folders
ga_ie: Taifead comhaid agus fillteáin le déanaí

source: System Integration
ga_ie: Comhtháthú Córais

source: Please try sign out Windows to take effect.
ga_ie: Déan iarracht logáil amach as Windows le go dtiocfaidh sé i bhfeidhm.

source: Github Style Alert
ga_ie: Foláireamh Stíle Github

source: Zoom when using mouse wheel and holding %@ key
ga_ie: Zúmáil agus roth na luiche á úsáid agus an eochair %@ á coinneáil síos

source: Current document contains unsaved changes. Do you want to switch to newly duplicated file?
ga_ie: Tá athruithe neamhshábháilte sa cháipéis reatha. Ar mhaith leat aistriú go dtí an comhad atá dúblaithe le déanaí?

source: Chapter Level in Outline
ga_ie: Leibhéal Caibidle in Achoimre

source: Enable inline math or code block math
ga_ie: Cumasaigh matamaitic inlíne nó matamaitic bhloc cóid

source: Code Block Math (```math code block)
ga_ie: Matamaitic Bloc Cód (```matamaitic bloc cód)

source: PicList Path
ga_ie: Cosán PicList

source: Auto Complete
ga_ie: Comhlánaigh Uathoibríoch

source: Enable autocomplete for Emojis
ga_ie: Cumasaigh uathchríochnú le haghaidh Emojis
