Repository: sponka9/Typora-i18n
Catalog: *.lproj/Welcome.strings
Languages: ga_ie

source: Welcome to Typora
ga_ie: Fáilte go dtí Typora

source: Thank you for using Typora 👋. Typora is a minimal markdown editor and markdown reader, it gives you a seamless experience between rendered rich style contents and its source code.
ga_ie: Go raibh maith agat as Typora 👋 a úsáid. Is eagarthóir agus léitheoir marcála síos íosta é Typora, a thugann eispéireas gan uaim duit idir ábhar stíl shaibhir rindreáilte agus a chód foinse.

source: Get Started
ga_ie: Faigh Tosaigh

source: Check following links if you're new to Markdown or Typora.
ga_ie: Seiceáil na naisc seo a leanas más rud é gur nua duit Markdown nó Typora.

source: Activate Typora
ga_ie: Gníomhachtaigh Typora

source: Already purchased a license? Fill the form below and activate Typora instantly.
ga_ie: An bhfuil ceadúnas ceannaithe agat cheana féin? Líon isteach an fhoirm thíos agus gníomhaigh Typora láithreach.

source: Email
ga_ie: Ríomhphost

source: Email Address
ga_ie: Seoladh Ríomhphoist

source: License Code
ga_ie: Cód Ceadúnais

source: Help
ga_ie: Cabhair

source: Find my License
ga_ie: Aimsigh mo Cheadúnas

source: Accept <a href='https://support.typora.io/License-Agreement/'>License Agreement</a> and <a href='https://support.typora.io/Privacy-Policy/'>Privacy Policy</a>.
ga_ie: Glac leis an <a href='https://support.typora.io/License-Agreement/'>gComhaontú Ceadúnais</a> agus leis an <a href='https://support.typora.io/Privacy-Policy/'>Polasaí Príobháideachais</a>.

source: Live Preview
ga_ie: Réamhamharc Beo

source: Write and read rendered output instantly.
ga_ie: Scríobh agus léigh aschur rindreáilte láithreach.

source: Markdown Syntax
ga_ie: Comhréir Markdown

source: Code blocks, YAML, tasks, footnotes, tables, math, diagrams
ga_ie: Bloic chóid, YAML, tascanna, nótaí coise, táblaí, matamaitic, léaráidí

source: Import / Export
ga_ie: Iompórtáil / Easpórtáil

source: Deliver your content in various formats.
ga_ie: Seachad do chuid ábhair i bhformáidí éagsúla.

source: Editing Experience
ga_ie: Taithí Eagarthóireachta

source: Outline / Word Count / Focus Mode / Typewriter Mode
ga_ie: Mód Imlíne / Líon Focal / Mód Fócais / Mód Clóscríbhneora

source: Files
ga_ie: Comhaid

source: Manage files in sidebar and search across files.
ga_ie: Bainistigh comhaid sa bharra taoibh agus déan cuardach trasna comhad.

source: Customize
ga_ie: Saincheap

source: Customize your writing experience from preferences panel.
ga_ie: Saincheap do thaithí scríbhneoireachta ón bpainéal roghanna.

source: Themes
ga_ie: Téamaí

source: Write in the theme you like, or make one by your own.
ga_ie: Scríobh isteach an téama is maith leat, nó cruthaigh ceann duit féin.

source: And more
ga_ie: Agus níos mó

source: Explore more topics at support.typora.io
ga_ie: Fiosraigh tuilleadh topaicí ag support.typora.io

source: Quick Start
ga_ie: Tús Tapa

source: Markdown Reference
ga_ie: Tagairt Markdown

source: Explore Themes
ga_ie: Taiscéal Téamaí

source: More Topics
ga_ie: Tuilleadh Topaicí

source: Typora Activated
ga_ie: Typora Gníomhachtaithe

source: Thanks for your purchase.
ga_ie: Go raibh maith agat as do cheannach.

source: Next
ga_ie: Ar Aghaidh

source: Please accept license agreement first
ga_ie: Glac leis an gcomhaontú ceadúnais ar dtús

source: Start %@ Days Trial
ga_ie: Tosaigh Triail %@ Laethanta

source: Buy License
ga_ie: Ceannaigh Ceadúnas

source: Activate
ga_ie: Gníomhachtaigh

source: Close
ga_ie: Dún

source: Deactivate
ga_ie: Díghníomhachtaigh

source: View License
ga_ie: Féach ar an gCeadúnas

source: Your Typora License
ga_ie: Do Cheadúnas Typora

source: This copy of Typora is registered with license information below.
ga_ie: Tá an chóip seo de Typora cláraithe leis an bhfaisnéis cheadúnais thíos.

source: Your trial will be expired in %@ days.
ga_ie: Beidh do thriail imithe in éag i %@ lá.

source: Enter License
ga_ie: Cuir Ceadúnas Isteach

source: Not Now
ga_ie: Ní Anois

source: Please input a valid email address
ga_ie: Cuir isteach seoladh ríomhphoist bailí le do thoil

source: Please input a valid license code
ga_ie: Cuir isteach cód ceadúnais bailí le do thoil

source: Your license has exceeded the max devices numbers. The oldest device was unregistered automatically.
ga_ie: Tá do cheadúnas tar éis an líon uasta gléasanna a shárú. Díchláraíodh an gléas is sine go huathoibríoch

source: This license code has been used with a different email address.
ga_ie: Úsáideadh an cód ceadúnais seo le seoladh ríomhphoist difriúil.

source: Unknown Error. Please contact hi@typora.io
ga_ie: Earráid anaithnid. Téigh i dteagmháil le hi@typora.io le do thoil.

source: Failed to access the license server. Please check your network or try again later.
ga_ie: Theip ar rochtain a fháil ar an bhfreastalaí ceadúnais. Seiceáil do líonra nó déan iarracht arís ar ball.

source: Enter a license code to support our development ❤
ga_ie: Cuir isteach cód ceadúnais chun tacú lenár bhforbairt ❤

source: Re-enter Email
ga_ie: Ath-iontráil Ríomhphost

source: Email address confirmation does not match.
ga_ie: Ní hionann dearbhú an seoladh ríomhphoist.

source: Are you sure to deactivate Typora on this device?
ga_ie: An bhfuil tú cinnte go ndíghníomhachtóidh tú Typora ar an ngléas seo?

source: Offline Activation
ga_ie: Gníomhachtú As Líne

source: Back
ga_ie: Ar ais

source: Get Activation Token
ga_ie: Faigh Comhartha Gníomhachtaithe

source: Your activated devices have exceeded the maximum limits.
ga_ie: Tá na huasteorainneacha sáraithe ag do ghléasanna gníomhachtaithe.
